tbobd/certification/test4/AvailabilityAndPricingRequest.xml

<soap:Envelope xmlns:soap="http://www.w3.org/2003/05/soap-envelope" xmlns:hot="http://TekTravel/HotelBookingApi">
<soap:Header xmlns:wsa="http://www.w3.org/2005/08/addressing">
<hot:Credentials UserName="clubonehotelsTest" Password="Clu@28527768">
</hot:Credentials>
<wsa:Action>http://TekTravel/HotelBookingApi/AvailabilityAndPricing</wsa:Action>
<wsa:To>https://api.tbotechnology.in/hotelapi_v7/hotelservice.svc</wsa:To>
</soap:Header>
<soap:Body>
    <hot:AvailabilityAndPricingRequest>
        <hot:ResultIndex>6</hot:ResultIndex>
        <hot:HotelCode></hot:HotelCode>
        <hot:SessionId>4388be79-b609-4946-bac0-8492ae16c435</hot:SessionId>
        <hot:OptionsForBooking>
            <hot:FixedFormat>true</hot:FixedFormat>
            <hot:RoomCombination>
                <hot:RoomIndex>1</hot:RoomIndex>
                <hot:RoomIndex>2</hot:RoomIndex>
            </hot:RoomCombination>
        </hot:OptionsForBooking>
    </hot:AvailabilityAndPricingRequest>
</soap:Body>
</soap:Envelope>